Revit 2027 API
BuiltInFailures.MEPFabricationFailures.FabricationRodDetachFromHangerError Property
 The rod need to be detached from hanger.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FabricationRodDetachFromHangerError { get; }
Public Shared ReadOnly Property FabricationRodDetachFromHangerError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FabricationRodDetachFromHangerError {
	FailureDefinitionId^ get ();
}
static member FabricationRodDetachFromHangerError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace